# ExtrusionEndParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ExtrusionEndParam Property
ParameterTypeId Class See Also
---
"Extrusion End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ExtrusionEndParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtrusionEndParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ExtrusionEndParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace